# Напишите программу, которая генерирует и выводит квадраты чисел от 1 до N с
# использованием генераторного выражения. Реализуйте функцию generate_squares,
# которая принимает число N в качестве аргумента и использует генераторное выражение
# для генерации квадратов чисел. Затем выведите квадраты чисел на экран.


def generate_squares(N):
    squares = (i ** 2 for i in range(1, N + 1))
    for square in squares:
        print(square)

N = 5
generate_squares(N)



----------------------------------------------
# 2. Напишите генератор, который будет генерировать бесконечную последовательность Фибоначчи.
# Каждый раз, когда генератор вызывается, он должен возвращать следующее число последовательности.
# Напишите программу, которая будет использовать этот генератор для вывода первых N чисел Фибоначчи.


def fibonacci_generator(N):
    a, b = 0, 1
    for _ in range(N):
        yield a
        a, b = b, a + b
def print_fibonacci_sequence(N):
    fib_gen = fibonacci_generator(N)
    print(f"Первые {N} чисел Фибоначчи:")
    for num in fib_gen:
        print(num)
N = int(input("Введите количество чисел Фибоначчи: "))
print_fibonacci_sequence(N)
