# 1. Напишите генератор, который будет принимать на вход числа и возвращать их сумму. 
# Генератор должен использовать инструкцию yield для возврата текущей суммы и должен продолжать принимать
# новые числа для добавления к сумме. Если генератор получает на вход число 0, он должен прекращать работу
# и вернуть окончательную сумму. Напишите программу, которая будет использовать этот генератор для пошагового
# расчета суммы чисел, вводимых пользователем.

def sum_generator():
    sum = 0
    while True:
        try:
            num = int(input("Введите число: "))
            if num == 0:
                return
            sum += num
            yield sum
        except ValueError:
            print("Ошибка: введите целое число.")


gen = sum_generator()

print("Введите числа для суммирования (0 для окончания):")
for sum in gen:
    print(f"Текущая сумма: {sum}")
#-------------------------------------------------------------------------------



#2. Напишите генератор, который будет генерировать арифметическую прогрессию

def progression():
    a = int(input("Введите начало пррогресии: "))
    b = int(input("ВВедите шаг прогресии: "))

    current = a
    while True:
        yield current
        current += b

gen = progression()

print("Генерация арифметической прогрессии:")
for value in gen:
    print(value)
    if value > 100:
        break