# 1. Напишите программу, которая принимает в качестве аргумента командной строки путь
# к файлу .py и запускает его. При запуске файла программа должна выводить сообщение
# "Файл <имя файла> успешно запущен". Если файл не существует или не может быть запущен,
# программа должна вывести соответствующее сообщение об ошибке.

import sys
import os

script_path = sys.argv[1]

if not os.path.isfile(script_path):
    print(f"Ошибка: Файл '{script_path}' не существует.")
else:
    try:
        exec(open(script_path).read())
        print(f"Файл '{script_path}' успешно запущен.")
    except Exception:
        print(f"Ошибка: Не удалось выполнить файл '{script_path}'.")

#-----------------------------------------------------------------

# 2. Напишите программу, которая принимает в качестве аргумента командной строки путь к
# директории и выводит список всех файлов и поддиректорий внутри этой директории.
# Для этой задачи используйте модуль os и его функцию walk. Программа должна выводить полный путь
# к каждому файлу и директории.
import sys
import os

directory_path = sys.argv[1]

for root, dirs, files in os.walk(directory_path):
    for name in dirs:
        print(os.path.join(root, name))
    for name in files:
        print(os.path.join(root, name))