# Напишите программу, которая принимает список слов от пользователя и использует генераторное выражение
# (comprehension) для создания нового списка, содержащего только те слова, которые начинаются с гласной буквы. 
# Затем программа должна использовать функцию map, чтобы преобразовать каждое слово в верхний регистр.
# В результате программа должна вывести новый список, содержащий только слова, начинающиеся
# с гласной буквы и записанные в верхнем регистре.



words = input("Введите слова через пробел: ").split()

vowels = 'AEIOUaeiou'
filtered_words = [word for word in words if word[0] in vowels]

uppercase_words = list(map(str.upper, filtered_words))
print(uppercase_words)





#--------------------------------------------------------------
# Напишите программу, которая принимает список чисел от пользователя и использует функцию reduce
# из модуля functools, чтобы найти произведение всех чисел в списке. Затем программа должна использовать
# функцию itertools.accumulate для накопления произведений чисел в новом списке. В результате программа должна
# вывести список, содержащий накопленные произведения.


from functools import reduce
from itertools import accumulate

numbers = list(map(int, input("Введите числа через пробел: ").split()))

product_of_numbers = reduce(lambda x, y: x * y, numbers)

accumulated_products = list(accumulate(numbers, lambda x, y: x * y))

print(f"Произведение всех чисел: {product_of_numbers}")
print(f"Накопленные произведения чисел: {accumulated_products}")